product-service/performance-test/timedeal/jmeter/concurrency-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="타임딜 재고 선점 동시성 테스트">
      <stringProp name="TestPlan.comments">초기 재고 100개에 대해 서로 다른 500명의 사용자가 수량 1개씩 동시에 구매 선점을 요청한다. 성공 요청은 최대 100건이어야 한다.</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="productHost" elementType="Argument">
            <stringProp name="Argument.name">productHost</stringProp>
            <stringProp name="Argument.value">${__P(productHost,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="productPort" elementType="Argument">
            <stringProp name="Argument.name">productPort</stringProp>
            <stringProp name="Argument.value">${__P(productPort,8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="timeDealId" elementType="Argument">
            <stringProp name="Argument.name">timeDealId</stringProp>
            <stringProp name="Argument.value">${__P(timeDealId,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="serviceKey" elementType="Argument">
            <stringProp name="Argument.name">serviceKey</stringProp>
            <stringProp name="Argument.value">local-dev-key</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="500명 구매 선점 Thread Group">
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer">
          <intProp name="groupSize">500</intProp>
          <longProp name="timeoutInMs">10000</longProp>
          <stringProp name="TestPlan.comments">500개 Thread가 구매 요청을 시작하는 시점을 최대한 맞춰 동시 접근을 유도한다. 10초 안에 500개가 모이지 않으면 대기 후 모인 Thread를 실행한다.</stringProp>
        </SyncTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="타임딜 구매 선점 요청">
          <stringProp name="HTTPSampler.domain">${productHost}</stringProp>
          <stringProp name="HTTPSampler.port">${productPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/internal/time-deals/${timeDealId}/purchases</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;orderId&quot;:&quot;${__UUID()}&quot;,&quot;quantity&quot;:1}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="내부 구매 API Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="X-Service-Key" elementType="Header">
                <stringProp name="Header.name">X-Service-Key</stringProp>
                <stringProp name="Header.value">${serviceKey}</stringProp>
              </elementProp>
              <elementProp name="X-User-Id" elementType="Header">
                <stringProp name="Header.name">X-User-Id</stringProp>
                <stringProp name="Header.value">${__UUID()}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>